# GetWallThickness

## Description
Gets the thickness of a wall

```pascal
FUNCTION GetWallThickness(
				h                 : HANDLE;
				VAR thicknessDist : REAL) : BOOLEAN;
```

```python

def vs.GetWallThickness(h):
    return (BOOLEAN, thicknessDist)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE||
|thicknessDist|REAL||

## Version
Availability: from VectorWorks12.0
## Category
* Objects - Walls